Revit 2027 API
ExportLinetypeInfo(String) Constructor
 Constructs a new ExportLinetypeInfo using the destination linetype name as input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLinetypeInfo(
	string destinationLinetypeName
)
Public Sub New (
	destinationLinetypeName As String
)
public:
ExportLinetypeInfo(
	String^ destinationLinetypeName
)
new :
        destinationLinetypeName : string -> ExportLinetypeInfo
Parameters
destinationLinetypeName String
 The destination line type name (the name of the linetype in the exported format).
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLinetypeInfo Class
ExportLinetypeInfo Overload
Autodesk.Revit.DB Namespace